{
  "body": "Overview: Online Shopping in Australia\r\n\nThe Online Shopping industry has grown dramatically over the past years. Rapid growth in internet and broadband penetration, and consumer acceptance of electronic commerce as a viable and safe alternative to traditional bricks-and-mortar retailing have aided online shopping.\r\n\nAustralia Post has created the 2019 eCommerce Industry Report about [Australian Online Shopping](https://auspost.com.au/content/dam/auspost_corp/media/documents/inside-australian-online-shopping-ecommerce-report.pdf), and we decided to make an overview about the key features showed on the report about the consumer behaviour in Australia. \r\n\nThe report has been prepared using 2017 and 2018 deliveries data recorded by the Australia Post Group and provides a comprehensive analysis of the latest trends in online buying behaviour, as well as insights into cross-border eCommerce and how technology is fundamentally shifting the shopping habits and expectations of Australians.\r\n\n\r\n\n## eCommerce \r\n\n\r\n\neCommerce in Australia is growing rapidly, with online spend reaching 10% of total retail sales in 2018, taking its share to two percentage points higher than the previous year. Australians spent $27.5 billion buying goods online, an increase of 24.4% year on year. \r\n\nIn comparison, total retail spend excluding cafes, restaurants and takeaway food services, recorded a modest 3% growth to reach $275.3 billion. \r\n\nWhen it comes to the number of purchases made online, purchases were up 20.2%, one percentage point higher than in 2017. While every month experienced double-digit growth, the first and last quarters grew above the national average.\r\n\nMore than 73% of Australian households shopped online in 2018. Given the strong up-take to shop online, we predict that eCommerce penetration will reach 12% of retail spend within the next three years. \r\n\nAccording to their consumer research, shoppers plan to continue or increase their online spend in 2019.\r\n\n \r\n\nWhat are Australians buying online?\r\n\n•\tFashion continues to be the main category purchased online, accounting for 27% of purchases. The category grew by 20.4% YOY, on par with the national average. Activewear had the strongest growth, up 37.5% YOY and Footwear grew by 23.8%.\r\n\n•\tVariety Stores offer a one-stop-shop for online shopping. These include large retailers, online Marketplaces and low-cost / Discount Stores. They accounted for 35.6% of all online purchases and grew by 21.5% YOY. The most common purchases from Variety Stores last year were Fashion and Consumer Electronic items, representing over 40% of purchases. Baby Products also grew strongly at 34% YOY.\r\r\n\n•\tHealth & Beauty recorded the strongest growth across all categories, up 29.4% YOY. Beauty and Cosmetics made up over half of these purchases and grew 36.4%. Black Friday / Cyber Monday was the busiest week for Beauty products and recorded strong growth, rising 54% YOY.\r\n\n•\tHomewares & Appliances had another solid year, growing 11.7%. While this is below the national average, when we add in Homewares & Appliances purchased through Variety Stores, this category’s market share almost doubles to 22.2%. Over half the purchases in this category are Homewares and Consumer Electronics, with both growing more than 14% YOY. Consumer Electronics were also the highest spend per purchase, increasing 6.1% YOY\r\n\n\r\n\n## Key Consumer trends \r\n\n![Online Shopping in Australia](https://ucarecdn.com/82fdfbf2-03d8-4462-8e54-e9e8b20f815e/ \"Online Shopping in Australia\")\n\n2018 was the ‘year of the sale’, with online sales events driving a spike in eCommerce growth. We also saw the continued rise of BNPL usage, Marketplace and mobile shopping, and a growing demand for express delivery.\r\n\nYear of the sale \r\n\nThe five weeks from 11 November to 15 December accounted for almost 15% of all eCommerce transactions. The peak for this period was Black Friday / Cyber Monday, which was the biggest online shopping week in Australia’s history, recording strong growth of over 28% YOY.\r\n\n\r\n\nCross-border eCommerce trends\r\n\n\r\n\nThe global online goods market is forecast to reach USD $3.43 trillion by 2023, taking the share to 17% of total retail. eCommerce has no borders, therefore there is a significant opportunity for Australian businesses to expand overseas.\r\n\n\r\n\nAustralians buying from abroad \r\n\n40% of Australian shoppers’ most recent purchases were from China. The number one overseas market for inbound eCommerce purchases is China, capturing 40% of Australian online shoppers’ most recent purchases. The United States, which has declined in share over the past two years, represents 21%, and the United Kingdom 14%.\r\n\nPurchase categories \r\n\nA quarter of Australia’s inbound eCommerce purchases were Fashion related. Sport & Leisure and Home & Garden products are trending upwards, at least two percentage points increase from 2017.\r\n\nMost popular purchasing sites \r\n\neBay, with 44% share of Australia’s inbound eCommerce purchases, is clearly the most popular international online shopping platform. This is followed by Amazon with 9% and Wish with 8% share.\r\n\n \r\n\n## Average order value \r\n\nTwo thirds of Australian respondents spent on average under $70, with 46% spending under $35 per transaction. \r\n\nReturns preference \r\n\nAustralian online shoppers prefer to return their international purchases at the Post Office (51%), with 21% preferring a delivery driver pick-up from home. This is similar to responses in 2017.\r\n\n\r\n\nOverseas shoppers buying from Australia\r\n\n\r\n\nOther than domestic purchases, Australian products were most likely to be purchased by consumers based in New Zealand (accounting for 29% of Australian exports), China (15%) and India (11%).\r\n\n\r\n\nPurchase categories \r\n\n\r\n\nAustralian Health & Beauty and Baby Products are in demand. Compared to the 41 markets surveyed, Australia is overrepresented in these categories. \r\n\nWhen it comes to the number of purchases, Fashion products are our leading eCommerce export, 31% of purchases are Fashion related on par with the global average.\r\n\n\r\n\n\r\n\n## The technology evolution\r\n\n\r\n\n![Online Shopping in Australia](https://ucarecdn.com/2f9d5e70-fd9c-42a1-be9c-cbf822da5ad4/ \" Online Shopping in Australia\")\n\nGrowth in technology has fundamentally shifted eCommerce shopping behaviour, as consumers now expect more\r\n\n\r\n\nVirtual assistants \r\n\nMore than ever, we are seeing an increase in the use of virtual assistants, whether they are embedded in a smartphone such as Siri or Google Assistant or a stand-alone smart speaker such as Alexa or Google Home.\r\n\nAlmost 1.35 million Australian consumers now have a smart speaker, with ownership growing 200% between July and November 2018 – smashing global records for uptake. \r\n\nWoolworths is already ahead of this trend, with the development of the Woolworths Assistant App for Google home, making it easy for consumers to create and add to their shopping lists on the go.\r\n\nBy 2020 it is estimated 30% of all searches will be completed without a screen. This makes accurate product tagging increasingly important for eCommerce retailers.\r\n\nAugmented reality\r\n\nAugmented reality is revolutionising the way we shop, by providing consumers the ability to ‘virtually’ try a range of products and styles before making a decision.\r\n\nIn the beauty sector, L’Oréal is one of many leading the way with its augmented reality app Modiface. Consumers can use the app to test and try L’Oréal beauty products online. From lipstick shades to different styles of makeup, consumers can instantly see what products work best for their style and skin tone.\r\n\nAs we are spending more time than ever online and are increasingly time poor, augmented reality is a trend that is set to grow.\r\n\n\r\n\nThe evolution of the chatbot\r\n\nWith continual improvements in language processing, AI-enabled chatbots offer the convenient, 24/7 personalised shopping experience consumers now expect. Chatbots can proactively give product recommendations and guide the conversation – just as a human sales assistant would do in a store.\r\n\nChatbots are an exciting opportunity for retailers, as they meet customer expectations for immediate support, in a cost-effective way.\r\n\n\r\n\n## New ways to pay\r\n\nThe average eCommerce website requires shoppers to click 22 times before completing their purchase. However, this is set to change with the use of biometric technology, which helps to eliminate fraud and speeds up the checkout process.\r\n\nResearch indicates 68% of consumers in Australia, the United States and the United Kingdom believe biometric payments will become more common within the next two to five years.\r\n\nAs online shoppers continue to embrace new technology, their habits change quickly, and so do their expectations of a speedier, more intuitive online shopping experience.",
  "slug": "Online-Shopping-in-Australia",
  "thumbnail": "https://ucarecdn.com/aa686b75-e77d-4b3e-abd2-9a7f64409a61/",
  "lang": "English ",
  "date": "2019-09-02T22:44:51.207Z",
  "subtitle": ". ",
  "title": "Overview: Online Shopping in Australia",
  "tags": [
    "E-commerce",
    "Digital Marketing",
    "Trends",
    "Online Shopping"
  ],
  "image": "https://ucarecdn.com/6190cdb5-6e22-4634-b430-d66952454afe/",
  "description": "The Online Shopping industry has grown dramatically over the past years. Rapid growth in internet and broadband penetration, and consumer acceptance of electronic commerce as a viable and safe alternative to traditional bricks-and-mortar retailing have aided online shopping. "
}