{
  "body": "The purpose of scheduling a meeting is present and formalise an idea before putting it into practice. A meeting that doesn’t have a concrete proposal, does not generate the expected results, ending in just time spent with coworkers. \r\n\nResearches [shows](https://hbr.org/2017/07/stop-the-meeting-madness) that too many meetings are counterproductive and more often than not, those who are always scheduling meetings, produce way less. On the other hand, the most productive people are the ones who make the least appointments or attend meetings unless strictly necessary.\r\n\nIt’s important to say that too many meetings are harmful not only regarding time and money, but also has a play of undermining the motivation and morale of those involved. Who never ask themselves: “another meeting, again?”. The idea is: meetings often delay decisions rather than make them effective.\r\n\nThe presence of a leader in the meeting is critical. Often those who set up the meeting are content to chair it, not conduct it. It's easy enough to get people arguing without getting anywhere, but a strong beacon presence is needed for the meeting to effectively produce results. \r\n\nIf well conducted, a meeting can greatly improve the quality of a project. A project only succeeds if everyone involved is responsible for it, as many decisions are not in their hands, the agreement of others is necessary for a certain process to be established. So, meetings will never end. To maximise your results, we’ve listed 10 points to make meetings more effective:\r\n\n## Culture \n\n\rCreate a culture where meetings are the exception, not the rule. If meetings are rare, more time is left for people to do the real work. Many problems can be solved by email, phone, social interaction, anything that does not require two or more people to move to a closed room solely to discuss processes. \r\n\n## Purpose \n\n\rThere are strategic meetings and tactical meetings. To know the difference, a strategic meeting must define which cake to bake; tactic is where you discuss which recipe will be used. Meaning one focuses on purpose, another focuses on tasks. Purposeless meetings are just chat rooms. Create an agenda for your meeting, keeping in mind that this occasion is not for reporting problems, but for solving them. Discussing a problem is valid only if it leads to a solution. Hoping that the solution will magically come up at the meeting is different than coming up with a solution proposal.\r\n\n## Agenda\n\nMeetings always requires preparation. Before scheduling a meeting, invite the attendees, disclosure the agenda e responsibilities and define the key stakeholders. Another important fact is the duration of the meeting. If only one hour was scheduled to the meeting, this hour must not exceed, unless extremely necessary.    \r\n\n## Deliverable \n\n\rThe meeting must have a purpose, as discussed. But what are the steps to reach this goal? Set realistic deliverables for your meeting to be effective. For example: changing the scope of a project that is under development; the purpose of the meeting is to decide if the project stops or continues, A few good deliverables for this meeting would be a schedule, a scope document, and a responsibility matrix. Tangible documents that drives the project to a conclusion.\r\n\n## Professionalism \n\n\rMeetings should have a non-intimidating, relaxed and professional atmosphere. And that is exactly how you should get into one of them. Leave the nastiness and the hassle outside the meeting room. Ego disputes only serve to numb and anger the uninvolved people, who are wasting their time seeing two children arguing over who has the prettiest stroller. Meetings are not dance contests, they must produce results. \r\n\n## Attendees\n\n![meetings-efficiently ](https://ucarecdn.com/b4c26513-690a-425f-9dfa-897e2e8a974f/ \"meetings-efficiently \")\n\nChoose well who is necessary or optional for the success of the meeting. If you pass 7 people, chances are too many people. As mentioned before, ego is something that should be left out of a meeting, To find out who to invite, answer the question: What does this person contributes for task X?\r\n\n## Leadership \n\nSomeone needs to be responsible for the meeting, and if you set it up, it's probably you. Your role? Very simple: put a brake on who is traveling too much, push who is sleeping, make sure the deliverable and the purpose of the meeting are fulfilled. Bad meetings are always the result of bad leadership.\r\n\n## Focus\n\n\rLook around you during the meeting. Everyone has a phone/notebook around, right? People have ways to get distracted during the meeting. Gently ask the person who is checking Facebook to pay attention. Of course, if someone is answering a corporate email to solve an issue, be understanding and ask them to handle it outside.\r\n\nLocation \n\n![meetings-efficiently ](https://ucarecdn.com/ccbd5cd3-3c49-4a5c-b6e8-b1bdf3bab4b1/ \"meetings-efficiently \")\n\nResist the temptation to make people move around a lot. If you work in a multi-unit company, and people are scattered, consider making a conference call with everyone at your desk. If the person needs to move around to get to the meeting, they will waste time and get angry because of traffic or some other reason. Therefore, use common sense when setting your meeting location. It needs to be good for everyone.\r\n\n## Closing \r\n\n\rAfter the meeting, the person who called the meeting should make an analysis of the important points, what went well, what went wrong, what each did or should do, whether the deliverables were met, etc. The secret is quite simple: companies that have big meetings only have big meetings for one reason: they dedicated their time to it.",
  "slug": "project-management-meetings ",
  "thumbnail": "https://ucarecdn.com/9f70ac6d-38e2-4ca7-b200-6c97c4e47540/",
  "lang": "english ",
  "date": "2019-08-30T01:58:42.076Z",
  "subtitle": ".",
  "title": "Project Management: Conducting meetings efficiently",
  "tags": [
    "project management",
    "business",
    "productivity"
  ],
  "image": "https://ucarecdn.com/92c3b4f0-5399-491a-a132-4c5660b8ad07/",
  "description": "Researches shows that too many meetings are counterproductive and those who are always scheduling meetings, produce way less. On the other hand, the most productive people are the ones who make the least appointments. If well conducted however, a meeting can greatly improve the quality of a project."
}