{
  "body": "“Good design is good business”.  The famous quote by Thomas J. Watson Jr. (former IBM president) sums up how important graphic designer work is to a company. After all, “good design” really does “good business”.\n\nOnly a few decades ago, high-level executives considered design as a matter of aesthetics or corporate image, left exclusively to the marketing team.  Now design is widely recognized as a key element in every business strategy.\n\nAccording to this article by [Time](https://time.com/5180711/the-meaning-of-design-is-up-for-debate/), a survey shows that many of the world's leading (and most lucrative) organizations have a design director and continue to invest heavily in this area. And half of them already believe that \"design plays a big role in achieving success.\"\n\nThe designer is also responsible for creating a brand's visual identity, communicating with marketing and the consumer. It's up to them to take care of the logo, business cards, look and feel of your website and e-commerce, how your product will look and how it will delight your customer.\n\nBut before you hire a designer at [Cavaon](https://www.cavaon.com/start-a-project) there are 8 design basics you should know better. Having a basic understanding of the subject is important before writing a brief and hiring design services: \n\n1. Alignment\n\nAlignment is one of the most important elements in a design piece as it is responsible for creating the sense of organization and allows the design to be 'clean', easy to understand, eliminating the mess.\n\nThe orientation of texts in the West is from left to right, from top to bottom. When there is something out of these patterns, the brain gets confused, and the information may not reach its consumer.\n\nTherefore, the elements and texts need to be aligned with each other and with the background. Of course, there may be exceptions to artistic creations, but they must be very well thought out.\n\n2. Visual Hierarchy\n\n![hiring-a-designer](https://ucarecdn.com/fd36a076-34e8-45d8-8eb4-c79e81970cb9/ \"hiring-a-designer\")\n\nWhen a design element has a lot of information, it is important to give more weight to what matters the most. We call this principle hierarchy.\n\nThis highlighting of information is usually done with fonts in different sizes, varying colours, etc.\n\nWhen briefing your project, keep in mind the main message you want to get across. If you want your company name next to a symbol and its tagline on the main image of your website, for example, the designer should make it all appear neat, first of all by highlighting the brand.\n\n3. Balance\n\nPrinciple of balance establishes the overall design structure: it ensures that the work is pleasantly balanced, in its colours, shapes, text boxes, etc., without making it “user-unfriendly” or “heavy”, disrupting the ultimate goal.\n\nThere are two types of balance: symmetrical, which happens when design elements are evenly divided on both sides of the project; while the asymmetric uses scale, colour and contrast to achieve this principle.\n\n4. Color\n\n![hiring-a-designer](https://ucarecdn.com/e4a3f2b7-0758-4896-86d8-33f1c12db29d/ \"hiring-a-designer\")\n\nCertainly, one of the most important principles, colour gives the tone and mood of a brand. The colour palette needs to be carefully chosen to convey the brand idea, its atmosphere and attract the public.\n\nThe graphic designer needs to have a basic knowledge of colour theory and psychology to build a logo according to what the client wants, as the palette is also paramount to the next principle, creating a pattern.\n\n5. Repeat\n\nAs we said earlier, our brain assimilates better when there are patterns. That is why the principle of repetition is important: to give strength and consistency to the final product. The colour palette, for example, helps you create branding and make your brand easily recognizable. Or, the menus and appearance of a website must always be in tune, always.\n\nBasically, the rule is: you should not randomly mix several things that make no sense or do not have connections with each other. There must always be harmony to create a comfortable standard for the consumer.\n\n6. Spacing\n\nWhat is left blank is as important as everything else. A certain amount of text, for example, needs to be wisely divided into blocks so that the reader does not get tired reading it (or even give up trying).\n\nSo-called negative spaces (or blanks) help make up the artwork. Often in a logo they even form a new figure, discreet and simple, but one that speaks to the consumer's subconscious.\n\n7. Proximity\n\nProximity helps to create a relationship between elements in design work, such as text and images. These elements do not necessarily have to be grouped but must be closely connected.\n\nThis can happen not only literally but also by a connection of colours, fonts, shapes, sizes, etc.",
  "slug": "hiring-a-designer",
  "thumbnail": "https://ucarecdn.com/7f27a23f-d712-484a-bb5e-9ffe2001fc64/",
  "lang": "English ",
  "date": "2019-08-30T01:22:25.842Z",
  "subtitle": ".",
  "title": "Things You Should Know Before Hiring a Designer ",
  "tags": [
    "web design",
    "eCommerce platform",
    "branding",
    "design"
  ],
  "image": "https://ucarecdn.com/da9f4153-307a-4dbb-b20e-0bd8ce53fe9e/",
  "description": "The designer is responsible for creating a brand's visual identity, communicating with marketing and the consumer. It's up to them to take care of the logo, business cards, look and feel of your website and e-commerce.  But before you hire a designer there are design basics you should know better."
}